//-----------------------------------------------------------------------------
// File : LinePS.hlsl
// Desc : Pixel Shader For Line Draw.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <SceneParameters.hlsli>


///////////////////////////////////////////////////////////////////////////////
// VSOutput structure
///////////////////////////////////////////////////////////////////////////////
struct VSOutput
{
    float4               Position : SV_POSITION;
    nointerpolation uint HitIndex : HIT_INDEX;
};

//-----------------------------------------------------------------------------
// Resources.
//-----------------------------------------------------------------------------
ConstantBuffer<SceneParameters> SceneParam : register(b1);

//-----------------------------------------------------------------------------
//      メインエントリーポイントです.
//-----------------------------------------------------------------------------
float4 main(const VSOutput input) : SV_TARGET0
{
    float4 color;

    // 有効なレイ.
    if (input.HitIndex < SceneParam.MaxIteration)
    {
        color = float4(0.0f, 1.0f, 0.0f, 1.0f);
    }
    // 無効なレイ.
    else
    {
        color = float4(1.0f, 0.0f, 0.0f, 1.0f);
    }

    return color;
}